// const isEmail =
//   /^[A-Za-z0-9ĐÀÁẢẠÃẦẤẨẬẪÂẮẰẶẴĂẲÈÉẸẺẼỂẾỀỆỄÊỊÌÍĨỈÒÓỎỌÕÔỐỒỔỘỖỜỚỠỢỞƠÙÚỤỦŨỨỪỬỮỰƯÝỲỶỸỴđàáảạãầấẩậẫâắằặẵăẳèéẹẻẽểếềệễêịìíĩỉòóỏọõôốồổộỗờớỡợởơùúụủũứừửữựưýỳỷỹỵ]{1}[A-Za-z0-9ĐÀÁẢẠÃẦẤẨẬẪÂẮẰẶẴĂẲÈÉẸẺẼỂẾỀỆỄÊỊÌÍĨỈÒÓỎỌÕÔỐỒỔỘỖỜỚỠỢỞƠÙÚỤỦŨỨỪỬỮỰƯÝỲỶỸỴđàáảạãầấẩậẫâắằặẵăẳèéẹẻẽểếềệễêịìíĩỉòóỏọõôốồổộỗờớỡợởơùúụủũứừửữựưýỳỷỹỵ.@]{2,40}$$/i; // bat dau bang chu cai hoac so, theo sau la chu cai, so hoac dau .
const isEmail =
  /(^(([\w]*[\w.]{1,})+([a-zA-Z]|([0-9]+[a-zA-Z])|([a-zA-Z]+[0-9]{1,})))|(^[a-zA-Z]+[\w]{2,}))+@([\w-]+\.)+[\w-]{2,4}$/;
// (^([\w][\w\.]+([a-zA-Z]|([0-9]+[a-zA-Z])|([a-zA-Z]+[0-9]{1,})))|(^[a-zA-Z]+[\w]{2,}))+@([\w-]+\.)+[\w-]{2,4}$
const isPhone =
  /^(((\+|)84)|0)(3[2-9]|5[6|8|9]|7[0|6-9]|8[0-6|8|9]|9[0-4|6-9])[0-9]{7}$/;
const noSpace = /^\S*$/; // check dinh dang so dien thoai,
const isFullName =
  /^[a-zA-ZĐÀÁẢẠÃẦẤẨẬẪÂẮẰẶẴĂẲÈÉẸẺẼỂẾỀỆỄÊỊÌÍĨỈÒÓỎỌÕÔỐỒỔỘỖỜỚỠỢỞƠÙÚỤỦŨỨỪỬỮỰƯÝỲỶỸỴđàáảạãầấẩậẫâắằặẵăẳèéẹẻẽểếềệễêịìíĩỉòóỏọõôốồổộỗờớỡợởơùúụủũứừửữựưýỳỷỹỵ ]+$/;
const isUserName = /^[a-zA-Z0-9_-]+$/;

const emailRegEx = /^[a-zA-Z0-9@._ ]+$/;
// const timeRegEx = /^([0-1]?[0-9]|2[0-3]):[0-5][0-9]$|[0-9]/;
const timeRegEx =
  /(([0-9]{1,2})[:]{1}([0-9]{1,2}))|([0-9]{1,2}[:])|([0-9]{1,2})/;
const passwordRegEx = /^[\w!@#$%^&*()-_+=,./?]*$/;

export {
  isEmail,
  isPhone,
  isFullName,
  isUserName,
  emailRegEx,
  passwordRegEx,
  noSpace,
  timeRegEx,
};
